# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactorSet..::..Contains Method
CorrectionFactorSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	CorrectionFactor item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As CorrectionFactor _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	CorrectionFactor^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..CorrectionFactor
# See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace